app/views/people/_form.html.erb

SELECT "catastrophes"."name", "catastrophes"."id" FROM "catastrophes"
---
    <%= form.label :catastrophe_id %>
    <%= form.select("catastrophe_id", Catastrophe.all.collect {|s| [s.name, s.id]}, {include_blank: 'Select...'}) %>