app/controllers/catastrophes_controller.rb

  def index
    @catastrophes = Catastrophe.all
---
SELECT "catastrophes".* FROM "catastrophes"

  def create
    @catastrophe = Catastrophe.new(catastrophe_params)

    respond_to do |format|
      if @catastrophe.save
---
INSERT INTO "catastrophes" ("catastrophe_code", "name", "degree_of_emergency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["catastrophe_code", 1000], ["name", "alagamento"], ["degree_of_emergency", 4], ["created_at", "2023-11-02 18:16:22.896419"], ["updated_at", "2023-11-02 18:16:22.896419"]]

  def update
    respond_to do |format|
      if @catastrophe.update(catastrophe_params)
---
UPDATE "catastrophes" SET "name" = $1, "updated_at" = $2 WHERE "catastrophes"."id" = $3  [["name", "11"], ["updated_at", "2023-11-22 23:50:39.879947"], ["id", 1]]

  def destroy
    @catastrophe.destroy
---
DELETE FROM "catastrophes" WHERE "catastrophes"."id" = $1  [["id", 1]]

    def set_catastrophe
      @catastrophe = Catastrophe.find(params[:id])
---
SELECT  "catastrophes".* FROM "catastrophes" WHERE "catastrophes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]