app/controllers/occurrences_controller.rb

  def index
    @occurrences = Occurrence.all
---
SELECT "occurrences".* FROM "occurrences"