app/controllers/people_controller.rb

SELECT "catastrophes"."name", "catastrophes"."id" FROM "catastrophes"
---
    def set_catastrophe_options
      @set_catastrophe_options = Catastrophe.all.pluck(:name, :id)