app/controllers/recipients_controller.rb

  def index
    @recipients = Recipient.all
---
SELECT "recipients".* FROM "recipients"

  def create
    @recipient = Recipient.new(recipient_params)

    respond_to do |format|
      if @recipient.save
---
INSERT INTO "recipients" ("family_quantity", "liter_of_water", "measure", "unit_of_measurement", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["family_quantity", 3], ["liter_of_water", 5], ["measure", ""], ["unit_of_measurement", ""], ["created_at", "2023-11-18 20:16:01.741314"], ["updated_at", "2023-11-18 20:16:01.741314"]]

  def destroy
    @recipient.destroy
---
DELETE FROM "recipients" WHERE "recipients"."id" = $1  [["id", 1]]

    def set_recipient
      @recipient = Recipient.find(params[:id])
---
SELECT  "recipients".* FROM "recipients" WHERE "recipients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]